nevinxu/HM502B2/platform/CMSIS/Include/device/MKL27Z4/MKL27Z4_registers.h
/*
 * Constants & macros for individual DMAMUX_CHCFGn bitfields
 */

/*!
 * @name Register DMAMUX_CHCFGn, field SOURCE[5:0] (RW)
 *
 * Specifies which DMA source, if any, is routed to a particular DMA channel.
 * See the chip-specific DMAMUX information for details about the peripherals and
 * their slot numbers.
 */
/*@{*/
#define BP_DMAMUX_CHCFGn_SOURCE (0U)       /*!< Bit position for DMAMUX_CHCFGn_SOURCE. */
#define BM_DMAMUX_CHCFGn_SOURCE (0x3FU)    /*!< Bit mask for DMAMUX_CHCFGn_SOURCE. */
#define BS_DMAMUX_CHCFGn_SOURCE (6U)       /*!< Bit field size in bits for DMAMUX_CHCFGn_SOURCE. */

/*! @brief Read current value of the DMAMUX_CHCFGn_SOURCE field. */
#define BR_DMAMUX_CHCFGn_SOURCE(x, n) (BME_UBFX8(HW_DMAMUX_CHCFGn_ADDR(x, n), BP_DMAMUX_CHCFGn_SOURCE, BS_DMAMUX_CHCFGn_SOURCE))

/*! @brief Format value for bitfield DMAMUX_CHCFGn_SOURCE. */
#define BF_DMAMUX_CHCFGn_SOURCE(v) ((uint8_t)((uint8_t)(v) << BP_DMAMUX_CHCFGn_SOURCE) & BM_DMAMUX_CHCFGn_SOURCE)

/*! @brief Set the SOURCE field to a new value. */
#define BW_DMAMUX_CHCFGn_SOURCE(x, n, v) (BME_BFI8(HW_DMAMUX_CHCFGn_ADDR(x, n), ((uint8_t)(v) << BP_DMAMUX_CHCFGn_SOURCE), BP_DMAMUX_CHCFGn_SOURCE, 6))
/*@}*/

/*!
 * @name Register DMAMUX_CHCFGn, field TRIG[6] (RW)
 *
 * Enables the periodic trigger capability for the triggered DMA channel.
 *
 * Values:
 * - 0 - Triggering is disabled. If triggering is disabled and ENBL is set, the
 *     DMA Channel will simply route the specified source to the DMA channel.
 *     (Normal mode)
 * - 1 - Triggering is enabled. If triggering is enabled and ENBL is set, the
 *     DMAMUX is in Periodic Trigger mode.
 */
/*@{*/
#define BP_DMAMUX_CHCFGn_TRIG (6U)         /*!< Bit position for DMAMUX_CHCFGn_TRIG. */
#define BM_DMAMUX_CHCFGn_TRIG (0x40U)      /*!< Bit mask for DMAMUX_CHCFGn_TRIG. */
#define BS_DMAMUX_CHCFGn_TRIG (1U)         /*!< Bit field size in bits for DMAMUX_CHCFGn_TRIG. */

/*! @brief Read current value of the DMAMUX_CHCFGn_TRIG field. */
#define BR_DMAMUX_CHCFGn_TRIG(x, n) (BME_UBFX8(HW_DMAMUX_CHCFGn_ADDR(x, n), BP_DMAMUX_CHCFGn_TRIG, BS_DMAMUX_CHCFGn_TRIG))

/*! @brief Format value for bitfield DMAMUX_CHCFGn_TRIG. */
#define BF_DMAMUX_CHCFGn_TRIG(v) ((uint8_t)((uint8_t)(v) << BP_DMAMUX_CHCFGn_TRIG) & BM_DMAMUX_CHCFGn_TRIG)

/*! @brief Set the TRIG field to a new value. */
#define BW_DMAMUX_CHCFGn_TRIG(x, n, v) (BME_BFI8(HW_DMAMUX_CHCFGn_ADDR(x, n), ((uint8_t)(v) << BP_DMAMUX_CHCFGn_TRIG), BP_DMAMUX_CHCFGn_TRIG, 1))
/*@}*/

/*!
 * @name Register DMAMUX_CHCFGn, field ENBL[7] (RW)
 *
 * Enables the DMA channel.
 *
 * Values:
 * - 0 - DMA channel is disabled. This mode is primarily used during
 *     configuration of the DMAMux. The DMA has separate channel enables/disables, which
 *     should be used to disable or reconfigure a DMA channel.
 * - 1 - DMA channel is enabled
 */
/*@{*/
#define BP_DMAMUX_CHCFGn_ENBL (7U)         /*!< Bit position for DMAMUX_CHCFGn_ENBL. */
#define BM_DMAMUX_CHCFGn_ENBL (0x80U)      /*!< Bit mask for DMAMUX_CHCFGn_ENBL. */
#define BS_DMAMUX_CHCFGn_ENBL (1U)         /*!< Bit field size in bits for DMAMUX_CHCFGn_ENBL. */

/*! @brief Read current value of the DMAMUX_CHCFGn_ENBL field. */
#define BR_DMAMUX_CHCFGn_ENBL(x, n) (BME_UBFX8(HW_DMAMUX_CHCFGn_ADDR(x, n), BP_DMAMUX_CHCFGn_ENBL, BS_DMAMUX_CHCFGn_ENBL))

/*! @brief Format value for bitfield DMAMUX_CHCFGn_ENBL. */
#define BF_DMAMUX_CHCFGn_ENBL(v) ((uint8_t)((uint8_t)(v) << BP_DMAMUX_CHCFGn_ENBL) & BM_DMAMUX_CHCFGn_ENBL)

/*! @brief Set the ENBL field to a new value. */
#define BW_DMAMUX_CHCFGn_ENBL(x, n, v) (BME_BFI8(HW_DMAMUX_CHCFGn_ADDR(x, n), ((uint8_t)(v) << BP_DMAMUX_CHCFGn_ENBL), BP_DMAMUX_CHCFGn_ENBL, 1))
/*@}*/

/*******************************************************************************
 * hw_dmamux_t - module struct
 ******************************************************************************/
/*!
 * @brief All DMAMUX module registers.
 */
#pragma pack(1)
typedef struct _hw_dmamux
{
    __IO hw_dmamux_chcfgn_t CHCFGn[4];     /*!< [0x0] Channel Configuration register */
} hw_dmamux_t;
#pragma pack()

/*! @brief Macro to access all DMAMUX registers. */
/*! @param x DMAMUX module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_DMAMUX_REGS(DMAMUX0_BASE)</code>. */
#define HW_DMAMUX_REGS(x) (*(hw_dmamux_t *)(x))

/*
 * MKL27Z4 FLEXIO
 *
 * The FLEXIO Memory Map/Register Definition can be found here.
 *
 * Registers defined in this header file:
 * - HW_FLEXIO_VERID - Version ID Register
 * - HW_FLEXIO_PARAM - Parameter Register
 * - HW_FLEXIO_CTRL - FlexIO Control Register
 * - HW_FLEXIO_SHIFTSTAT - Shifter Status Register
 * - HW_FLEXIO_SHIFTERR - Shifter Error Register
 * - HW_FLEXIO_TIMSTAT - Timer Status Register
 * - HW_FLEXIO_SHIFTSIEN - Shifter Status Interrupt Enable
 * - HW_FLEXIO_SHIFTEIEN - Shifter Error Interrupt Enable
 * - HW_FLEXIO_TIMIEN - Timer Interrupt Enable Register
 * - HW_FLEXIO_SHIFTSDEN - Shifter Status DMA Enable
 * - HW_FLEXIO_SHIFTCTLn - Shifter Control N Register
 * - HW_FLEXIO_SHIFTCFGn - Shifter Configuration N Register
 * - HW_FLEXIO_SHIFTBUFn - Shifter Buffer N Register
 * - HW_FLEXIO_SHIFTBUFBBSn - Shifter Buffer N Bit Byte Swapped Register
 * - HW_FLEXIO_SHIFTBUFBYSn - Shifter Buffer N Byte Swapped Register
 * - HW_FLEXIO_SHIFTBUFBISn - Shifter Buffer N Bit Swapped Register
 * - HW_FLEXIO_TIMCTLn - Timer Control N Register
 * - HW_FLEXIO_TIMCFGn - Timer Configuration N Register
 * - HW_FLEXIO_TIMCMPn - Timer Compare N Register
 *
 * - hw_flexio_t - Struct containing all module registers.
 */

#define HW_FLEXIO_INSTANCE_COUNT (1U) /*!< Number of instances of the FLEXIO module. */
#define HW_FLEXIO (0U) /*!< Instance number for FLEXIO. */

/*******************************************************************************
 * HW_FLEXIO_VERID - Version ID Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_VERID - Version ID Register (RO)
 *
 * Reset value: 0x01000000U
 *
 * .
 */
typedef union _hw_flexio_verid
{
    uint32_t U;
    struct _hw_flexio_verid_bitfields
    {
        uint32_t FEATURE : 16;         /*!< [15:0] Feature Specification Number */
        uint32_t MINOR : 8;            /*!< [23:16] Minor Version Number */
        uint32_t MAJOR : 8;            /*!< [31:24] Major Version Number */
    } B;
} hw_flexio_verid_t;

/*!
 * @name Constants and macros for entire FLEXIO_VERID register
 */
/*@{*/
#define HW_FLEXIO_VERID_ADDR(x)  ((uint32_t)(x) + 0x0U)

#define HW_FLEXIO_VERID(x)       (*(__I hw_flexio_verid_t *) HW_FLEXIO_VERID_ADDR(x))
#define HW_FLEXIO_VERID_RD(x)    (HW_FLEXIO_VERID(x).U)
/*@}*/

