nevinxu/HM502B2/platform/CMSIS/Include/device/MKL27Z4/MKL27Z4_registers.h
/*******************************************************************************
 * HW_FLEXIO_TIMCFGn - Timer Configuration N Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_TIMCFGn - Timer Configuration N Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The options to enable or disable the timer using the Timer N-1 enable or
 * disable are reserved when N is evenly divisible by 4 (eg: Timer 0).
 */
typedef union _hw_flexio_timcfgn
{
    uint32_t U;
    struct _hw_flexio_timcfgn_bitfields
    {
        uint32_t RESERVED0 : 1;        /*!< [0]  */
        uint32_t TSTART : 1;           /*!< [1] Timer Start Bit */
        uint32_t RESERVED1 : 2;        /*!< [3:2]  */
        uint32_t TSTOP : 2;            /*!< [5:4] Timer Stop Bit */
        uint32_t RESERVED2 : 2;        /*!< [7:6]  */
        uint32_t TIMENA : 3;           /*!< [10:8] Timer Enable */
        uint32_t RESERVED3 : 1;        /*!< [11]  */
        uint32_t TIMDIS : 3;           /*!< [14:12] Timer Disable */
        uint32_t RESERVED4 : 1;        /*!< [15]  */
        uint32_t TIMRST : 3;           /*!< [18:16] Timer Reset */
        uint32_t RESERVED5 : 1;        /*!< [19]  */
        uint32_t TIMDEC : 2;           /*!< [21:20] Timer Decrement */
        uint32_t RESERVED6 : 2;        /*!< [23:22]  */
        uint32_t TIMOUT : 2;           /*!< [25:24] Timer Output */
        uint32_t RESERVED7 : 6;        /*!< [31:26]  */
    } B;
} hw_flexio_timcfgn_t;

/*!
 * @name Constants and macros for entire FLEXIO_TIMCFGn register
 */
/*@{*/
#define HW_FLEXIO_TIMCFGn_COUNT (4U)

#define HW_FLEXIO_TIMCFGn_ADDR(x, n) ((uint32_t)(x) + 0x480U + (0x4U * (n)))

#define HW_FLEXIO_TIMCFGn(x, n)  (*(__IO hw_flexio_timcfgn_t *) HW_FLEXIO_TIMCFGn_ADDR(x, n))
#define HW_FLEXIO_TIMCFGn_RD(x, n) (HW_FLEXIO_TIMCFGn(x, n).U)
#define HW_FLEXIO_TIMCFGn_WR(x, n, v) (HW_FLEXIO_TIMCFGn(x, n).U = (v))
#define HW_FLEXIO_TIMCFGn_SET(x, n, v) (BME_OR32(HW_FLEXIO_TIMCFGn_ADDR(x, n), (uint32_t)(v)))
#define HW_FLEXIO_TIMCFGn_CLR(x, n, v) (BME_AND32(HW_FLEXIO_TIMCFGn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_FLEXIO_TIMCFGn_TOG(x, n, v) (BME_XOR32(HW_FLEXIO_TIMCFGn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_TIMCFGn bitfields
 */

/*!
 * @name Register FLEXIO_TIMCFGn, field TSTART[1] (RW)
 *
 * When start bit is enabled, configured shifters will output the contents of
 * the start bit when the timer is enabled and the timer counter will reload from
 * the compare register on the first rising edge of the shift clock.
 *
 * Values:
 * - 0 - Start bit disabled
 * - 1 - Start bit enabled
 */
/*@{*/
#define BP_FLEXIO_TIMCFGn_TSTART (1U)      /*!< Bit position for FLEXIO_TIMCFGn_TSTART. */
#define BM_FLEXIO_TIMCFGn_TSTART (0x00000002U) /*!< Bit mask for FLEXIO_TIMCFGn_TSTART. */
#define BS_FLEXIO_TIMCFGn_TSTART (1U)      /*!< Bit field size in bits for FLEXIO_TIMCFGn_TSTART. */

/*! @brief Read current value of the FLEXIO_TIMCFGn_TSTART field. */
#define BR_FLEXIO_TIMCFGn_TSTART(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TSTART, BS_FLEXIO_TIMCFGn_TSTART))

/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TSTART. */
#define BF_FLEXIO_TIMCFGn_TSTART(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TSTART) & BM_FLEXIO_TIMCFGn_TSTART)

/*! @brief Set the TSTART field to a new value. */
#define BW_FLEXIO_TIMCFGn_TSTART(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TSTART), BP_FLEXIO_TIMCFGn_TSTART, 1))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCFGn, field TSTOP[5:4] (RW)
 *
 * The stop bit can be added on a timer compare (between each word) or on a
 * timer disable. When stop bit is enabled, configured shifters will output the
 * contents of the stop bit when the timer is disabled. When stop bit is enabled on
 * timer disable, the timer remains disabled until the next rising edge of the
 * shift clock. If configured for both timer compare and timer disable, only one stop
 * bit is inserted on timer disable.
 *
 * Values:
 * - 00 - Stop bit disabled
 * - 01 - Stop bit is enabled on timer compare
 * - 10 - Stop bit is enabled on timer disable
 * - 11 - Stop bit is enabled on timer compare and timer disable
 */
/*@{*/
#define BP_FLEXIO_TIMCFGn_TSTOP (4U)       /*!< Bit position for FLEXIO_TIMCFGn_TSTOP. */
#define BM_FLEXIO_TIMCFGn_TSTOP (0x00000030U) /*!< Bit mask for FLEXIO_TIMCFGn_TSTOP. */
#define BS_FLEXIO_TIMCFGn_TSTOP (2U)       /*!< Bit field size in bits for FLEXIO_TIMCFGn_TSTOP. */

/*! @brief Read current value of the FLEXIO_TIMCFGn_TSTOP field. */
#define BR_FLEXIO_TIMCFGn_TSTOP(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TSTOP, BS_FLEXIO_TIMCFGn_TSTOP))

/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TSTOP. */
#define BF_FLEXIO_TIMCFGn_TSTOP(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TSTOP) & BM_FLEXIO_TIMCFGn_TSTOP)

/*! @brief Set the TSTOP field to a new value. */
#define BW_FLEXIO_TIMCFGn_TSTOP(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TSTOP), BP_FLEXIO_TIMCFGn_TSTOP, 2))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCFGn, field TIMENA[10:8] (RW)
 *
 * Configures the condition that causes the Timer to be enabled and start
 * decrementing.
 *
 * Values:
 * - 000 - Timer always enabled
 * - 001 - Timer enabled on Timer N-1 enable
 * - 010 - Timer enabled on Trigger high
 * - 011 - Timer enabled on Trigger high and Pin high
 * - 100 - Timer enabled on Pin rising edge
 * - 101 - Timer enabled on Pin rising edge and Trigger high
 * - 110 - Timer enabled on Trigger rising edge
 * - 111 - Timer enabled on Trigger rising or falling edge
 */
/*@{*/
#define BP_FLEXIO_TIMCFGn_TIMENA (8U)      /*!< Bit position for FLEXIO_TIMCFGn_TIMENA. */
#define BM_FLEXIO_TIMCFGn_TIMENA (0x00000700U) /*!< Bit mask for FLEXIO_TIMCFGn_TIMENA. */
#define BS_FLEXIO_TIMCFGn_TIMENA (3U)      /*!< Bit field size in bits for FLEXIO_TIMCFGn_TIMENA. */

/*! @brief Read current value of the FLEXIO_TIMCFGn_TIMENA field. */
#define BR_FLEXIO_TIMCFGn_TIMENA(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TIMENA, BS_FLEXIO_TIMCFGn_TIMENA))

/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TIMENA. */
#define BF_FLEXIO_TIMCFGn_TIMENA(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMENA) & BM_FLEXIO_TIMCFGn_TIMENA)

/*! @brief Set the TIMENA field to a new value. */
#define BW_FLEXIO_TIMCFGn_TIMENA(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMENA), BP_FLEXIO_TIMCFGn_TIMENA, 3))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCFGn, field TIMDIS[14:12] (RW)
 *
 * Configures the condition that causes the Timer to be disabled and stop
 * decrementing.
 *
 * Values:
 * - 000 - Timer never disabled
 * - 001 - Timer disabled on Timer N-1 disable
 * - 010 - Timer disabled on Timer compare
 * - 011 - Timer disabled on Timer compare and Trigger Low
 * - 100 - Timer disabled on Pin rising or falling edge
 * - 101 - Timer disabled on Pin rising or falling edge provided Trigger is high
 * - 110 - Timer disabled on Trigger falling edge
 * - 111 - Reserved
 */
/*@{*/
#define BP_FLEXIO_TIMCFGn_TIMDIS (12U)     /*!< Bit position for FLEXIO_TIMCFGn_TIMDIS. */
#define BM_FLEXIO_TIMCFGn_TIMDIS (0x00007000U) /*!< Bit mask for FLEXIO_TIMCFGn_TIMDIS. */
#define BS_FLEXIO_TIMCFGn_TIMDIS (3U)      /*!< Bit field size in bits for FLEXIO_TIMCFGn_TIMDIS. */

/*! @brief Read current value of the FLEXIO_TIMCFGn_TIMDIS field. */
#define BR_FLEXIO_TIMCFGn_TIMDIS(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TIMDIS, BS_FLEXIO_TIMCFGn_TIMDIS))

/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TIMDIS. */
#define BF_FLEXIO_TIMCFGn_TIMDIS(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMDIS) & BM_FLEXIO_TIMCFGn_TIMDIS)

/*! @brief Set the TIMDIS field to a new value. */
#define BW_FLEXIO_TIMCFGn_TIMDIS(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMDIS), BP_FLEXIO_TIMCFGn_TIMDIS, 3))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCFGn, field TIMRST[18:16] (RW)
 *
 * Configures the condition that causes the timer counter (and optionally the
 * timer output) to be reset. In 8-bit counter mode, the timer reset will only
 * reset the lower 8-bits that configure the baud rate. In all other modes, the timer
 * reset will reset the full 16-bits of the counter.
 *
 * Values:
 * - 000 - Timer never reset
 * - 001 - Reserved
 * - 010 - Timer reset on Timer Pin equal to Timer Output
 * - 011 - Timer reset on Timer Trigger equal to Timer Output
 * - 100 - Timer reset on Timer Pin rising edge
 * - 101 - Reserved
 * - 110 - Timer reset on Trigger rising edge
 * - 111 - Timer reset on Trigger rising or falling edge
 */
/*@{*/
#define BP_FLEXIO_TIMCFGn_TIMRST (16U)     /*!< Bit position for FLEXIO_TIMCFGn_TIMRST. */
#define BM_FLEXIO_TIMCFGn_TIMRST (0x00070000U) /*!< Bit mask for FLEXIO_TIMCFGn_TIMRST. */
#define BS_FLEXIO_TIMCFGn_TIMRST (3U)      /*!< Bit field size in bits for FLEXIO_TIMCFGn_TIMRST. */

/*! @brief Read current value of the FLEXIO_TIMCFGn_TIMRST field. */
#define BR_FLEXIO_TIMCFGn_TIMRST(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TIMRST, BS_FLEXIO_TIMCFGn_TIMRST))

