nevinxu/HM502B2/platform/CMSIS/Include/device/MKL27Z4/MKL27Z4_registers.h
/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TIMRST. */
#define BF_FLEXIO_TIMCFGn_TIMRST(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMRST) & BM_FLEXIO_TIMCFGn_TIMRST)

/*! @brief Set the TIMRST field to a new value. */
#define BW_FLEXIO_TIMCFGn_TIMRST(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMRST), BP_FLEXIO_TIMCFGn_TIMRST, 3))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCFGn, field TIMDEC[21:20] (RW)
 *
 * Configures the source of the Timer decrement and the source of the Shift
 * clock.
 *
 * Values:
 * - 00 - Decrement counter on FlexIO clock, Shift clock equals Timer output.
 * - 01 - Decrement counter on Trigger input (both edges), Shift clock equals
 *     Timer output.
 * - 10 - Decrement counter on Pin input (both edges), Shift clock equals Pin
 *     input.
 * - 11 - Decrement counter on Trigger input (both edges), Shift clock equals
 *     Trigger input.
 */
/*@{*/
#define BP_FLEXIO_TIMCFGn_TIMDEC (20U)     /*!< Bit position for FLEXIO_TIMCFGn_TIMDEC. */
#define BM_FLEXIO_TIMCFGn_TIMDEC (0x00300000U) /*!< Bit mask for FLEXIO_TIMCFGn_TIMDEC. */
#define BS_FLEXIO_TIMCFGn_TIMDEC (2U)      /*!< Bit field size in bits for FLEXIO_TIMCFGn_TIMDEC. */

/*! @brief Read current value of the FLEXIO_TIMCFGn_TIMDEC field. */
#define BR_FLEXIO_TIMCFGn_TIMDEC(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TIMDEC, BS_FLEXIO_TIMCFGn_TIMDEC))

/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TIMDEC. */
#define BF_FLEXIO_TIMCFGn_TIMDEC(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMDEC) & BM_FLEXIO_TIMCFGn_TIMDEC)

/*! @brief Set the TIMDEC field to a new value. */
#define BW_FLEXIO_TIMCFGn_TIMDEC(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMDEC), BP_FLEXIO_TIMCFGn_TIMDEC, 2))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCFGn, field TIMOUT[25:24] (RW)
 *
 * Configures the initial state of the Timer Output and whether it is affected
 * by the Timer reset.
 *
 * Values:
 * - 00 - Timer output is logic one when enabled and is not affected by timer
 *     reset
 * - 01 - Timer output is logic zero when enabled and is not affected by timer
 *     reset
 * - 10 - Timer output is logic one when enabled and on timer reset
 * - 11 - Timer output is logic zero when enabled and on timer reset
 */
/*@{*/
#define BP_FLEXIO_TIMCFGn_TIMOUT (24U)     /*!< Bit position for FLEXIO_TIMCFGn_TIMOUT. */
#define BM_FLEXIO_TIMCFGn_TIMOUT (0x03000000U) /*!< Bit mask for FLEXIO_TIMCFGn_TIMOUT. */
#define BS_FLEXIO_TIMCFGn_TIMOUT (2U)      /*!< Bit field size in bits for FLEXIO_TIMCFGn_TIMOUT. */

/*! @brief Read current value of the FLEXIO_TIMCFGn_TIMOUT field. */
#define BR_FLEXIO_TIMCFGn_TIMOUT(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TIMOUT, BS_FLEXIO_TIMCFGn_TIMOUT))

/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TIMOUT. */
#define BF_FLEXIO_TIMCFGn_TIMOUT(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMOUT) & BM_FLEXIO_TIMCFGn_TIMOUT)

/*! @brief Set the TIMOUT field to a new value. */
#define BW_FLEXIO_TIMCFGn_TIMOUT(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMOUT), BP_FLEXIO_TIMCFGn_TIMOUT, 2))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_TIMCMPn - Timer Compare N Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_TIMCMPn - Timer Compare N Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_timcmpn
{
    uint32_t U;
    struct _hw_flexio_timcmpn_bitfields
    {
        uint32_t CMP : 16;             /*!< [15:0] Timer Compare Value */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_flexio_timcmpn_t;

/*!
 * @name Constants and macros for entire FLEXIO_TIMCMPn register
 */
/*@{*/
#define HW_FLEXIO_TIMCMPn_COUNT (4U)

#define HW_FLEXIO_TIMCMPn_ADDR(x, n) ((uint32_t)(x) + 0x500U + (0x4U * (n)))

#define HW_FLEXIO_TIMCMPn(x, n)  (*(__IO hw_flexio_timcmpn_t *) HW_FLEXIO_TIMCMPn_ADDR(x, n))
#define HW_FLEXIO_TIMCMPn_RD(x, n) (HW_FLEXIO_TIMCMPn(x, n).U)
#define HW_FLEXIO_TIMCMPn_WR(x, n, v) (HW_FLEXIO_TIMCMPn(x, n).U = (v))
#define HW_FLEXIO_TIMCMPn_SET(x, n, v) (BME_OR32(HW_FLEXIO_TIMCMPn_ADDR(x, n), (uint32_t)(v)))
#define HW_FLEXIO_TIMCMPn_CLR(x, n, v) (BME_AND32(HW_FLEXIO_TIMCMPn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_FLEXIO_TIMCMPn_TOG(x, n, v) (BME_XOR32(HW_FLEXIO_TIMCMPn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_TIMCMPn bitfields
 */

/*!
 * @name Register FLEXIO_TIMCMPn, field CMP[15:0] (RW)
 *
 * The timer compare value is loaded into the timer counter when the timer is
 * first enabled, when the timer is reset and when the timer decrements down to
 * zero. In dual 8-bit counters baud/bit mode, the lower 8-bits configures the baud
 * rate divider equal to (CMP[7:0] + 1) * 2. The upper 8-bits configure the
 * number of bits in each word equal to (CMP[15:8] + 1) / 2. In dual 8-bit counters
 * PWM mode, the lower 8-bits configure the high period of the output to (CMP[7:0]
 * + 1) * 2. The upper 8-bits configure the low period of the output to
 * (CMP[15:8] + 1) * 2. In 16-bit counter mode, the compare value can be used to generate
 * the baud rate divider (if shift clock source is timer output) to equal
 * (CMP[15:0] + 1) * 2. When the shift clock source is a pin or trigger input, the
 * compare register is used to set the number of bits in each word equal to (CMP[15:0]
 * + 1) / 2.
 */
/*@{*/
#define BP_FLEXIO_TIMCMPn_CMP (0U)         /*!< Bit position for FLEXIO_TIMCMPn_CMP. */
#define BM_FLEXIO_TIMCMPn_CMP (0x0000FFFFU) /*!< Bit mask for FLEXIO_TIMCMPn_CMP. */
#define BS_FLEXIO_TIMCMPn_CMP (16U)        /*!< Bit field size in bits for FLEXIO_TIMCMPn_CMP. */

/*! @brief Read current value of the FLEXIO_TIMCMPn_CMP field. */
#define BR_FLEXIO_TIMCMPn_CMP(x, n) (BME_UBFX32(HW_FLEXIO_TIMCMPn_ADDR(x, n), BP_FLEXIO_TIMCMPn_CMP, BS_FLEXIO_TIMCMPn_CMP))

/*! @brief Format value for bitfield FLEXIO_TIMCMPn_CMP. */
#define BF_FLEXIO_TIMCMPn_CMP(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCMPn_CMP) & BM_FLEXIO_TIMCMPn_CMP)

