nevinxu/HM502B2/platform/CMSIS/Include/device/MKL27Z4/MKL27Z4_registers.h
/*! @brief Read current value of the TPM_CONF_CROT field. */
#define BR_TPM_CONF_CROT(x)  (BME_UBFX32(HW_TPM_CONF_ADDR(x), BP_TPM_CONF_CROT, BS_TPM_CONF_CROT))

/*! @brief Format value for bitfield TPM_CONF_CROT. */
#define BF_TPM_CONF_CROT(v)  ((uint32_t)((uint32_t)(v) << BP_TPM_CONF_CROT) & BM_TPM_CONF_CROT)

/*! @brief Set the CROT field to a new value. */
#define BW_TPM_CONF_CROT(x, v) (BME_BFI32(HW_TPM_CONF_ADDR(x), ((uint32_t)(v) << BP_TPM_CONF_CROT), BP_TPM_CONF_CROT, 1))
/*@}*/

/*!
 * @name Register TPM_CONF, field CPOT[19] (RW)
 *
 * When enabled, the counter will pause incrementing while the trigger remains
 * asserted (level sensitive). This field should only be changed when the TPM
 * counter is disabled.
 */
/*@{*/
#define BP_TPM_CONF_CPOT     (19U)         /*!< Bit position for TPM_CONF_CPOT. */
#define BM_TPM_CONF_CPOT     (0x00080000U) /*!< Bit mask for TPM_CONF_CPOT. */
#define BS_TPM_CONF_CPOT     (1U)          /*!< Bit field size in bits for TPM_CONF_CPOT. */

/*! @brief Read current value of the TPM_CONF_CPOT field. */
#define BR_TPM_CONF_CPOT(x)  (BME_UBFX32(HW_TPM_CONF_ADDR(x), BP_TPM_CONF_CPOT, BS_TPM_CONF_CPOT))

/*! @brief Format value for bitfield TPM_CONF_CPOT. */
#define BF_TPM_CONF_CPOT(v)  ((uint32_t)((uint32_t)(v) << BP_TPM_CONF_CPOT) & BM_TPM_CONF_CPOT)

/*! @brief Set the CPOT field to a new value. */
#define BW_TPM_CONF_CPOT(x, v) (BME_BFI32(HW_TPM_CONF_ADDR(x), ((uint32_t)(v) << BP_TPM_CONF_CPOT), BP_TPM_CONF_CPOT, 1))
/*@}*/

/*!
 * @name Register TPM_CONF, field TRGPOL[22] (RW)
 *
 * Selects the polarity of the external trigger source. This field should only
 * be changed when the TPM counter is disabled.
 *
 * Values:
 * - 0 - Trigger is active high.
 * - 1 - Trigger is active low.
 */
/*@{*/
#define BP_TPM_CONF_TRGPOL   (22U)         /*!< Bit position for TPM_CONF_TRGPOL. */
#define BM_TPM_CONF_TRGPOL   (0x00400000U) /*!< Bit mask for TPM_CONF_TRGPOL. */
#define BS_TPM_CONF_TRGPOL   (1U)          /*!< Bit field size in bits for TPM_CONF_TRGPOL. */

/*! @brief Read current value of the TPM_CONF_TRGPOL field. */
#define BR_TPM_CONF_TRGPOL(x) (BME_UBFX32(HW_TPM_CONF_ADDR(x), BP_TPM_CONF_TRGPOL, BS_TPM_CONF_TRGPOL))

/*! @brief Format value for bitfield TPM_CONF_TRGPOL. */
#define BF_TPM_CONF_TRGPOL(v) ((uint32_t)((uint32_t)(v) << BP_TPM_CONF_TRGPOL) & BM_TPM_CONF_TRGPOL)

/*! @brief Set the TRGPOL field to a new value. */
#define BW_TPM_CONF_TRGPOL(x, v) (BME_BFI32(HW_TPM_CONF_ADDR(x), ((uint32_t)(v) << BP_TPM_CONF_TRGPOL), BP_TPM_CONF_TRGPOL, 1))
/*@}*/

/*!
 * @name Register TPM_CONF, field TRGSRC[23] (RW)
 *
 * Selects between internal (channel pin input capture) or external trigger
 * sources. When selecting an internal trigger, the channel selected should be
 * configured for input capture. Only a rising edge input capture can be used to
 * initially start the counter using the CSOT configuration; either rising edge or
 * falling edge input capture can be used to reload the counter using the CROT
 * configuration; and the state of the channel input pin is used to pause the counter
 * using the CPOT configuration. The channel polarity register can be used to
 * invert the polarity of the channel input pins. This field should only be changed
 * when the TPM counter is disabled.
 *
 * Values:
 * - 0 - Trigger source selected by TRGSEL is external.
 * - 1 - Trigger source selected by TRGSEL is internal (channel pin input
 *     capture).
 */
/*@{*/
#define BP_TPM_CONF_TRGSRC   (23U)         /*!< Bit position for TPM_CONF_TRGSRC. */
#define BM_TPM_CONF_TRGSRC   (0x00800000U) /*!< Bit mask for TPM_CONF_TRGSRC. */
#define BS_TPM_CONF_TRGSRC   (1U)          /*!< Bit field size in bits for TPM_CONF_TRGSRC. */

/*! @brief Read current value of the TPM_CONF_TRGSRC field. */
#define BR_TPM_CONF_TRGSRC(x) (BME_UBFX32(HW_TPM_CONF_ADDR(x), BP_TPM_CONF_TRGSRC, BS_TPM_CONF_TRGSRC))

/*! @brief Format value for bitfield TPM_CONF_TRGSRC. */
#define BF_TPM_CONF_TRGSRC(v) ((uint32_t)((uint32_t)(v) << BP_TPM_CONF_TRGSRC) & BM_TPM_CONF_TRGSRC)

/*! @brief Set the TRGSRC field to a new value. */
#define BW_TPM_CONF_TRGSRC(x, v) (BME_BFI32(HW_TPM_CONF_ADDR(x), ((uint32_t)(v) << BP_TPM_CONF_TRGSRC), BP_TPM_CONF_TRGSRC, 1))
/*@}*/

/*!
 * @name Register TPM_CONF, field TRGSEL[27:24] (RW)
 *
 * Selects the input trigger to use for starting, reloading and/or pausing the
 * counter. The source of the trigger (external or internal to the TPM) is
 * configured by the TRGSRC field. This field should only be changed when the TPM
 * counter is disabled. Refer to the chip configuration section for available external
 * trigger options. The available internal trigger sources are listed below.
 *
 * Values:
 * - 0001 - Channel 0 pin input capture
 * - 0010 - Channel 1 pin input capture
 * - 0011 - Channel 0 or Channel 1 pin input capture
 * - 0100 - Channel 2 pin input capture
 * - 0101 - Channel 0 or Channel 2 pin input capture
 * - 0110 - Channel 1 or Channel 2 pin input capture
 * - 0111 - Channel 0 or Channel 1 or Channel 2 pin input capture
 * - 1000 - Channel 3 pin input capture
 * - 1001 - Channel 0 or Channel 3 pin input capture
 * - 1010 - Channel 1 or Channel 3 pin input capture
 * - 1011 - Channel 0 or Channel 1 or Channel 3 pin input capture
 * - 1100 - Channel 2 or Channel 3 pin input capture
 * - 1101 - Channel 0 or Channel 2 or Channel 3 pin input capture
 * - 1110 - Channel 1 or Channel 2 or Channel 3 pin input capture
 * - 1111 - Channel 0 or Channel 1 or Channel 2 or Channel 3 pin input capture
 */
/*@{*/
#define BP_TPM_CONF_TRGSEL   (24U)         /*!< Bit position for TPM_CONF_TRGSEL. */
#define BM_TPM_CONF_TRGSEL   (0x0F000000U) /*!< Bit mask for TPM_CONF_TRGSEL. */
#define BS_TPM_CONF_TRGSEL   (4U)          /*!< Bit field size in bits for TPM_CONF_TRGSEL. */

/*! @brief Read current value of the TPM_CONF_TRGSEL field. */
#define BR_TPM_CONF_TRGSEL(x) (BME_UBFX32(HW_TPM_CONF_ADDR(x), BP_TPM_CONF_TRGSEL, BS_TPM_CONF_TRGSEL))

/*! @brief Format value for bitfield TPM_CONF_TRGSEL. */
#define BF_TPM_CONF_TRGSEL(v) ((uint32_t)((uint32_t)(v) << BP_TPM_CONF_TRGSEL) & BM_TPM_CONF_TRGSEL)

/*! @brief Set the TRGSEL field to a new value. */
#define BW_TPM_CONF_TRGSEL(x, v) (BME_BFI32(HW_TPM_CONF_ADDR(x), ((uint32_t)(v) << BP_TPM_CONF_TRGSEL), BP_TPM_CONF_TRGSEL, 4))
/*@}*/

