nevinxu/HM502B2/platform/CMSIS/Include/device/MKL27Z4/MKL27Z4_registers.h
/*! @brief Format value for bitfield UART_AP7816B_T0_ADTI_L. */
#define BF_UART_AP7816B_T0_ADTI_L(v) ((uint8_t)((uint8_t)(v) << BP_UART_AP7816B_T0_ADTI_L) & BM_UART_AP7816B_T0_ADTI_L)

/*! @brief Set the ADTI_L field to a new value. */
#define BW_UART_AP7816B_T0_ADTI_L(x, v) (HW_UART_AP7816B_T0_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_WP7816A_T0 - UART 7816 Wait Parameter Register A
 ******************************************************************************/

/*!
 * @brief HW_UART_WP7816A_T0 - UART 7816 Wait Parameter Register A (RW)
 *
 * Reset value: 0x00U
 *
 * The WP7816A_T0 register contains constants used in the generation of various
 * wait time counters. To save register space, this register is used differently
 * when C7816[TTYPE] = 0 and C7816[TTYPE] = 1. This register may be read at any
 * time. This register must be written to only when C7816[ISO_7816E] is not set.
 */
typedef union _hw_uart_wp7816a_t0
{
    uint8_t U;
    struct _hw_uart_wp7816a_t0_bitfields
    {
        uint8_t WI_H : 8;              /*!< [7:0] Wait Time Integer High (C7816[TTYPE] =
                                        * 0) */
    } B;
} hw_uart_wp7816a_t0_t;

/*!
 * @name Constants and macros for entire UART_WP7816A_T0 register
 */
/*@{*/
#define HW_UART_WP7816A_T0_ADDR(x) ((uint32_t)(x) + 0x3CU)

#define HW_UART_WP7816A_T0(x)    (*(__IO hw_uart_wp7816a_t0_t *) HW_UART_WP7816A_T0_ADDR(x))
#define HW_UART_WP7816A_T0_RD(x) (HW_UART_WP7816A_T0(x).U)
#define HW_UART_WP7816A_T0_WR(x, v) (HW_UART_WP7816A_T0(x).U = (v))
#define HW_UART_WP7816A_T0_SET(x, v) (BME_OR8(HW_UART_WP7816A_T0_ADDR(x), (uint8_t)(v)))
#define HW_UART_WP7816A_T0_CLR(x, v) (BME_AND8(HW_UART_WP7816A_T0_ADDR(x), (uint8_t)(~(v))))
#define HW_UART_WP7816A_T0_TOG(x, v) (BME_XOR8(HW_UART_WP7816A_T0_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART_WP7816A_T0 bitfields
 */

/*!
 * @name Register UART_WP7816A_T0, field WI_H[7:0] (RW)
 *
 * Used to calculate the value used for the WT counter. This register field
 * provides the most significant byte of the 16 bit Wait Time Integer field WI formed
 * by {WP7816A_T0[WI_H], WP7816B_T0[WI_L]}. The value of WI = 0 is invalid and
 * must not be programmed. This value is used only when C7816[TTYPE] = 0. See Wait
 * time and guard time parameters.
 */
/*@{*/
#define BP_UART_WP7816A_T0_WI_H (0U)       /*!< Bit position for UART_WP7816A_T0_WI_H. */
#define BM_UART_WP7816A_T0_WI_H (0xFFU)    /*!< Bit mask for UART_WP7816A_T0_WI_H. */
#define BS_UART_WP7816A_T0_WI_H (8U)       /*!< Bit field size in bits for UART_WP7816A_T0_WI_H. */

/*! @brief Read current value of the UART_WP7816A_T0_WI_H field. */
#define BR_UART_WP7816A_T0_WI_H(x) (HW_UART_WP7816A_T0(x).U)

/*! @brief Format value for bitfield UART_WP7816A_T0_WI_H. */
#define BF_UART_WP7816A_T0_WI_H(v) ((uint8_t)((uint8_t)(v) << BP_UART_WP7816A_T0_WI_H) & BM_UART_WP7816A_T0_WI_H)

/*! @brief Set the WI_H field to a new value. */
#define BW_UART_WP7816A_T0_WI_H(x, v) (HW_UART_WP7816A_T0_WR(x, v))
/*@}*/
/*******************************************************************************
 * HW_UART_WP7816B_T0 - UART 7816 Wait Parameter Register B
 ******************************************************************************/

/*!
 * @brief HW_UART_WP7816B_T0 - UART 7816 Wait Parameter Register B (RW)
 *
 * Reset value: 0x14U
 *
 * The WP7816B_T0 register contains constants used in the generation of various
 * wait time counters. To save register space, this register is used differently
 * when C7816[TTYPE] = 0 and C7816[TTYPE] = 1. This register may be read at any
 * time. This register must be written to only when C7816[ISO_7816E] is not set.
 */
typedef union _hw_uart_wp7816b_t0
{
    uint8_t U;
    struct _hw_uart_wp7816b_t0_bitfields
    {
        uint8_t WI_L : 8;              /*!< [7:0] Wait Time Integer Low (C7816[TTYPE] = 0)
                                        * */
    } B;
} hw_uart_wp7816b_t0_t;

/*!
 * @name Constants and macros for entire UART_WP7816B_T0 register
 */
/*@{*/
#define HW_UART_WP7816B_T0_ADDR(x) ((uint32_t)(x) + 0x3DU)

#define HW_UART_WP7816B_T0(x)    (*(__IO hw_uart_wp7816b_t0_t *) HW_UART_WP7816B_T0_ADDR(x))
#define HW_UART_WP7816B_T0_RD(x) (HW_UART_WP7816B_T0(x).U)
#define HW_UART_WP7816B_T0_WR(x, v) (HW_UART_WP7816B_T0(x).U = (v))
#define HW_UART_WP7816B_T0_SET(x, v) (BME_OR8(HW_UART_WP7816B_T0_ADDR(x), (uint8_t)(v)))
#define HW_UART_WP7816B_T0_CLR(x, v) (BME_AND8(HW_UART_WP7816B_T0_ADDR(x), (uint8_t)(~(v))))
#define HW_UART_WP7816B_T0_TOG(x, v) (BME_XOR8(HW_UART_WP7816B_T0_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART_WP7816B_T0 bitfields
 */

/*!
 * @name Register UART_WP7816B_T0, field WI_L[7:0] (RW)
 *
 * Used to calculate the value used for the WT counter. This register field
 * provides the least significant byte of the 16 bit Wait Time Integer field WI
 * formed by {WP7816A_T0[WI_H], WP7816B_T0[WI_L]} . The value of WI = 0 is invalid and
 * must not be programmed. This value is used only when C7816[TTYPE] = 0. See
 * Wait time and guard time parameters.
 */
/*@{*/
#define BP_UART_WP7816B_T0_WI_L (0U)       /*!< Bit position for UART_WP7816B_T0_WI_L. */
#define BM_UART_WP7816B_T0_WI_L (0xFFU)    /*!< Bit mask for UART_WP7816B_T0_WI_L. */
#define BS_UART_WP7816B_T0_WI_L (8U)       /*!< Bit field size in bits for UART_WP7816B_T0_WI_L. */

/*! @brief Read current value of the UART_WP7816B_T0_WI_L field. */
#define BR_UART_WP7816B_T0_WI_L(x) (HW_UART_WP7816B_T0(x).U)

/*! @brief Format value for bitfield UART_WP7816B_T0_WI_L. */
#define BF_UART_WP7816B_T0_WI_L(v) ((uint8_t)((uint8_t)(v) << BP_UART_WP7816B_T0_WI_L) & BM_UART_WP7816B_T0_WI_L)

/*! @brief Set the WI_L field to a new value. */
#define BW_UART_WP7816B_T0_WI_L(x, v) (HW_UART_WP7816B_T0_WR(x, v))
/*@}*/
/*******************************************************************************
 * HW_UART_WP7816A_T1 - UART 7816 Wait Parameter Register A
 ******************************************************************************/

/*!
 * @brief HW_UART_WP7816A_T1 - UART 7816 Wait Parameter Register A (RW)
 *
 * Reset value: 0x00U
 *
 * The WP7816A_T1 register contains constants used in the generation of various
 * wait time counters. To save register space, this register is used differently
 * when C7816[TTYPE] = 0 and C7816[TTYPE] = 1. This register may be read at any
 * time. This register must be written to only when C7816[ISO_7816E] is not set.
 */
typedef union _hw_uart_wp7816a_t1
{
    uint8_t U;
    struct _hw_uart_wp7816a_t1_bitfields
    {
        uint8_t BWI_H : 8;             /*!< [7:0] Block Wait Time Integer High
                                        * (C7816[TTYPE] = 1) */
    } B;
} hw_uart_wp7816a_t1_t;

/*!
 * @name Constants and macros for entire UART_WP7816A_T1 register
 */
/*@{*/
#define HW_UART_WP7816A_T1_ADDR(x) ((uint32_t)(x) + 0x3CU)

#define HW_UART_WP7816A_T1(x)    (*(__IO hw_uart_wp7816a_t1_t *) HW_UART_WP7816A_T1_ADDR(x))
#define HW_UART_WP7816A_T1_RD(x) (HW_UART_WP7816A_T1(x).U)
#define HW_UART_WP7816A_T1_WR(x, v) (HW_UART_WP7816A_T1(x).U = (v))
#define HW_UART_WP7816A_T1_SET(x, v) (BME_OR8(HW_UART_WP7816A_T1_ADDR(x), (uint8_t)(v)))
#define HW_UART_WP7816A_T1_CLR(x, v) (BME_AND8(HW_UART_WP7816A_T1_ADDR(x), (uint8_t)(~(v))))
#define HW_UART_WP7816A_T1_TOG(x, v) (BME_XOR8(HW_UART_WP7816A_T1_ADDR(x), (uint8_t)(v)))
/*@}*/

